nist_asce_60pct/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoamWind;

startFrom       latestTime;

startTime		0;

stopAt          endTime;

endTime			50;

deltaT			0.00025;

writeControl	runTime;

writeInterval	5;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   8;

adjustTimeStep  no;

maxCo           0.75;

maxDeltaT       0.5;

runTimeModifiable true;

//constrainShear    on;
//constrainWallDist 0.1;

functions
{
    //#include "probes"    
}

libs (
    "libwindOFfvOptions.so"
    "libwindOFwallModels.so"
	"libOpenFOAM.so"
	"libsimpleFunctionObjects.so"
);

// ************************************************************************* //
