nist_asce_60pct/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (2 0 0)
    (2 1 0)
    (0 1 0)
    (0 0 1)
    (2 0 1)
    (2 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 60 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type            patch;
        faces           ((4 5 6 7));
    }
    bottom
    {
        type            wall;
        faces           ((0 3 2 1));
    }

    inlet
    {
        type            cyclic;
        neighbourPatch  outlet;
        faces           ((0 4 7 3));
    }
    outlet
    {
        type            cyclic;
        neighbourPatch  inlet;
        faces           ((1 2 6 5));
    }

    sidewall1
    {
        type            cyclic;
        neighbourPatch  sidewall2;
        faces           ((0 1 5 4));
    }
    sidewall2
    {
        type            cyclic;
        neighbourPatch  sidewall1;
        faces           ((2 3 7 6));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
