nist_asce_60pct/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// Internal field modified by mapFields utility
internalField   uniform (0 0 0);

boundaryField
{
	#include "include/horizontalWallBC"
	
    top
    {
        type            slip;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
