nist_asce_60pct/0/include/horizontalWallBC
inlet
{
    type        cyclic;
}

outlet
{
    type        cyclic;
}

sidewall1
{
    type        cyclic;
}

sidewall2
{
    type        cyclic;
}
