nist_asce_60pct/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

// Internal field modified by mapFields utility
internalField   uniform 2e-5;

boundaryField
{
    #include "include/horizontalWallBC"

    top
    {
        type            slip;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
