nist_asce_60pct/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/physicalParameters"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	#include "include/HorizontalWallBC"

    top
    {
        type            slip;
    }
    bottom
    {
        type            nutSchumannWallFunction;
        kappa           $KAPPA;
        z0              $Z0;
        value           uniform 0.0;
    }
}


// ************************************************************************* //
