nist_asce_60pct/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                  GAMG;
        tolerance               1e-06;
        relTol                  0.01;
        smoother                GaussSeidel;
        //nPreSweeps            0;
        //nPostSweeps           2;
        cacheAgglomeration      true;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        mergeLevels             1;
    }

    pFinal
    {
        solver                  GAMG;
        tolerance               1e-06;
        relTol                  0;
        smoother                GaussSeidel;
        chcheAgglomeration      true;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        mergeLevels             1;
        //$p;
        //smoother        GaussSeidel;
        //tolerance       1e-06;
        //relTol          0;
    }

    "(U|k|nuTilda)"
    {
        //solver          smoothSolver;
        solver                  PBiCG;
        preconditioner          DILU;
        //smoother        symGaussSeidel;
        tolerance               1e-08;
        relTol                  0.0;
    }

    "(U|k|nuTilda)Final"
    {
        $U;
        tolerance               1e-08;
        relTol                  0;
    }
}

PIMPLE
{
    nOuterCorrectors            2;
    nCorrectors                 2;
    nNonOrthogonalCorrectors    0;
    pRefCell                    0;
    pRefValue                   0;
}

relaxationFactors
{
    fields
    {
        p   0.4;
    }
    equations
    {
        U   0.8;
        k   0.8;
    }
}


// ************************************************************************* //
