nist_asce_60pct/system/probes
probes
{
    functionObjectLibs("libsampling.so");
    type            probes;
    name            probes;
    outputControl   timeStep;
    outputInterval  10;

    fields
    (
        p U
    );

    probeLocations
    (
        (0.00 0.50 0.100)
        (0.25 0.50 0.100)
        (0.50 0.50 0.100)
        (0.75 0.50 0.100)
        (1.25 0.50 0.100)
        (1.00 0.50 0.010)
        (1.00 0.50 0.050)
        (1.00 0.50 0.100)
        (1.00 0.50 0.115)
        (1.00 0.50 0.130)
        (1.00 0.50 0.145)
        (1.00 0.50 0.200)
        (1.00 0.50 0.500)
        (1.00 0.50 0.800)
        (1.00 0.50 1.000)
        (1.00 0.41 0.100)
        (1.00 0.42 0.100)
        (1.00 0.43 0.100)
        (1.00 0.44 0.100)
        (1.00 0.45 0.100)
    );
}
